## Ordinal Number(Rank) Encoding

Providing ranks for categorical columns having features.......Greater is the rank of a word indicating more important is the word.
#### Eg: 
    1) Grading System --- A,B,C,D,F
    2) Experience of a Batsman in cricket.

In [1]:
import datetime

In [2]:
today_date =datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2020, 8, 12, 12, 17, 34, 139418)

In [4]:
today_date - datetime.timedelta(3)

datetime.datetime(2020, 8, 9, 12, 17, 34, 139418)

In [6]:
#### List Comprehension
days = [today_date - datetime.timedelta(x) for x in range(0,15)]
days

[datetime.datetime(2020, 8, 12, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 11, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 10, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 9, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 8, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 7, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 6, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 5, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 4, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 3, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 2, 12, 17, 34, 139418),
 datetime.datetime(2020, 8, 1, 12, 17, 34, 139418),
 datetime.datetime(2020, 7, 31, 12, 17, 34, 139418),
 datetime.datetime(2020, 7, 30, 12, 17, 34, 139418),
 datetime.datetime(2020, 7, 29, 12, 17, 34, 139418)]

In [7]:
import pandas as pd
data =pd.DataFrame(days)
data.head()

                           0
0 2020-08-12 12:17:34.139418
1 2020-08-11 12:17:34.139418
2 2020-08-10 12:17:34.139418
3 2020-08-09 12:17:34.139418
4 2020-08-08 12:17:34.139418

In [11]:
data.columns =["Day"]

In [12]:
data.head()

                         Day
0 2020-08-12 12:17:34.139418
1 2020-08-11 12:17:34.139418
2 2020-08-10 12:17:34.139418
3 2020-08-09 12:17:34.139418
4 2020-08-08 12:17:34.139418

In [23]:
data['weekday'] =data['Day'].dt.day_name()
data.head()

                         Day    weekday
0 2020-08-12 12:17:34.139418  Wednesday
1 2020-08-11 12:17:34.139418    Tuesday
2 2020-08-10 12:17:34.139418     Monday
3 2020-08-09 12:17:34.139418     Sunday
4 2020-08-08 12:17:34.139418   Saturday

In [24]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [25]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [26]:
data['weekday_ordinal'] = data['weekday'].map(dictionary)

In [27]:
data

                          Day    weekday  weekday_ordinal
0  2020-08-12 12:17:34.139418  Wednesday                3
1  2020-08-11 12:17:34.139418    Tuesday                2
2  2020-08-10 12:17:34.139418     Monday                1
3  2020-08-09 12:17:34.139418     Sunday                7
4  2020-08-08 12:17:34.139418   Saturday                6
5  2020-08-07 12:17:34.139418     Friday                5
6  2020-08-06 12:17:34.139418   Thursday                4
7  2020-08-05 12:17:34.139418  Wednesday                3
8  2020-08-04 12:17:34.139418    Tuesday                2
9  2020-08-03 12:17:34.139418     Monday                1
10 2020-08-02 12:17:34.139418     Sunday                7
11 2020-08-01 12:17:34.139418   Saturday                6
12 2020-07-31 12:17:34.139418     Friday                5
13 2020-07-30 12:17:34.139418   Thursday                4
14 2020-07-29 12:17:34.139418  Wednesday                3

## 2.Count Or Frequency Encoding

In [3]:
import pandas as pd
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [30]:
columns=[1,3,5,6,7,8,9,13]

In [31]:
train_set = train_set[columns]

In [32]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [33]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [34]:
for feature in train_set.columns:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [35]:
train_set.shape

(32561, 8)

In [36]:
country_map = train_set['Country'].value_counts().to_dict()

In [37]:
train_set['Country'] = train_set['Country'].map(country_map)
train_set.head(20)

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

##### Advantages
1. Not increasing feature space

##### Disadvantages
1. It will provide same weight if the frequencies are same so it is difficult to recognize the importance of individual...

## 3.Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [38]:
import pandas as pd
df=pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [39]:
df['Cabin'].fillna('Missing',inplace=True)

In [42]:
df['Cabin'].value_counts()

Missing        687
G6               4
B96 B98          4
C23 C25 C27      4
C22 C26          3
              ...
A6               1
A7               1
B82 B84          1
D45              1
C95              1
Name: Cabin, Length: 148, dtype: int64

In [45]:
df['Cabin'].astype(str).str[0]
#extracting only 1st character from the all string series..

0      M
1      C
2      M
3      C
4      M
      ..
886    M
887    B
888    M
889    C
890    M
Name: Cabin, Length: 891, dtype: object

In [46]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [47]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [48]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [49]:
# here we are extracting probability of people survived from each type of cabin
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [51]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [52]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [70]:
enumerate(ordinal_labels,0)

In [53]:
ordinal_labels2 = {k:i for i,k in enumerate(ordinal_labels)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [54]:
df['Cabin_ordinal_labels'] = df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

## 4.Mean Encoding

In [75]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [76]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [77]:
df['mean_ordinal_encode'] = df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

##### Disadvantages:
* It leads to the overfitting.

## 5.Probability Ratio Encoding

It is based on applying ``odds Probability`` for each category in a column.

**odds Probablity = (probability of event happpend / probability of event doesn't happpens)**

In [1]:
import pandas as pd

df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [2]:
### Replacing
df['Cabin'].fillna('Missing',inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [3]:
df['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [4]:
df['Cabin'] = df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [5]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [6]:
#find the percentage of people survived wrt to cabin.
prob_df = df.groupby(['Cabin'])['Survived'].mean()
prob_df

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [7]:
prob_df = pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [8]:
prob_df['Died'] = 1 - prob_df['Survived']

prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [9]:
prob_df['Probability_ratio'] = prob_df['Survived']/prob_df['Died']
prob_df.head()

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [16]:
prob_df.loc['C']

Survived             0.593220
Died                 0.406780
Probability_ratio    1.458333
Name: C, dtype: float64

In [11]:
prob_df['Probability_ratio'].to_dict()

{'A': 0.875,
 'B': 2.916666666666666,
 'C': 1.4583333333333333,
 'D': 3.125,
 'E': 3.0,
 'F': 1.6000000000000003,
 'G': 1.0,
 'M': 0.42827442827442824,
 'T': 0.0}

In [12]:
probability_encoded = prob_df['Probability_ratio'].to_dict()

df['Cabin_encoded'] = df['Cabin'].map(probability_encoded)
df.head()
#hence we can remove cabin column and proceed trianing..

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274